app/controllers/listings_controller.rb

  def create
    # パラメーターとともに現在のユーザーのリスティングを作成
    @listing = current_user.listings.build(listing_params)

    #セーブできたら
    if @listing.save
---
INSERT INTO "listings" ("home_type", "pet_type", "pet_size", "breeding_years", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["home_type", "一軒家"], ["pet_type", "鳥類"], ["pet_size", "小型"], ["breeding_years", 2], ["user_id", 2], ["created_at", 2017-03-17 11:40:56 UTC], ["updated_at", 2017-03-17 11:40:56 UTC]]

  def update
    if @listing.update(listing_params)
---
UPDATE "listings" SET "price_pernight" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["price_pernight", 100], ["updated_at", 2017-03-17 16:08:37 UTC], ["id", 4]]