app/controllers/photos_controller.rb

INSERT INTO "photos" ("listing_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@photo = Photo.new(photo_params)
		if @photo.save

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 2]]
---
	def destroy
		@photo = Photo.find(params[:id])
		if @photo.destroy

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."listing_id" = ?  [["listing_id", 4]]
---
	def list
		listing = Listing.find(params[:listing_id])

		photos = []
		Photo.where(listing_id: listing.id).each do |photo|