app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show #show.html.erbを表示するアクション。
		@user = User.find(params[:id]) #Userモデルから、userを探してきた。